import numpy as np
from AntSystem import ASsolve
from CloneSelect import CSsolve

cities = np.array([[1304, 2312], [3639, 1315], [4177, 2244], [3712, 1399], [3488, 1535], [3326, 1556],
                   [3238, 1229], [4196, 1044], [4312, 790], [4386, 570], [3007, 1970], [2562, 1756],
                   [2788, 1491], [2381, 1676], [1332, 695], [3715, 1678], [3918, 2179], [4061, 2370],
                   [3780, 2212], [3676, 2578], [4029, 2838], [4263, 2931], [3429, 1908], [3507, 2376],
                   [3394, 2643], [3439, 3201], [2935, 3240], [3140, 3550], [2545, 2357], [2778, 2826],
                   [2370, 2975]])
N_ant = 40  # 蚂蚁个数
N_city = cities.shape[0]  # 城市个数
alpha = 1  # 信息素重要程度
beta = 5  # 启发因子重要程度
rho = 0.5  # 信息素的挥发速度
Q = 1  # 完成率
N_iter = 100  # 迭代次数
Np = 40  #种群个数
N_clone = 10  #克隆个数
ASsolve(cities,N_ant,N_iter,alpha,beta,rho,Q)
CSsolve(cities,Np,N_clone,N_iter)
